tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# All in one for **env
brew "anyenv"
# Isolated development environments using Docker
brew "docker-compose"
# Prevents you from committing sensitive information to a git repo
brew "git-secrets"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Network Kanji code conversion Filter (NKF)
brew "nkf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10", link: false
# Programmatically correct mistyped console commands
brew "thefuck"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Additional completion definitions for zsh
brew "zsh-completions"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Multi-track audio editor and recorder
cask "audacity"
# Plain-text editor for web pages, program source codes and more
cask "coteditor"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# End-to-end encryption software
cask "keybase"
# Open-source software for live streaming and screen recording
cask "obs"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Twitter", id: 1482454543
mas "Xcode", id: 497799835
mas "デジタル時計", id: 1287009111
vscode "ecmel.vscode-html-css"
vscode "foxundermoon.shell-format"
vscode "GitHub.vscode-pull-request-github"
vscode "MS-CEINTL.vscode-language-pack-ja"
